app/views/customers/index.html.erb

SELECT COUNT(*) FROM "customers"
---
              <i class="fas fa-info-circle mr-2"></i>
              Found <strong><%= pluralize(@customers.count, 'customer') %></strong>