app/views/customers/missing_email.html.erb

SELECT "customers".* FROM "customers" WHERE ("customers"."email_address" = '' OR "customers"."email_address" IS NULL)
SELECT COUNT(*) FROM "customers" WHERE ("customers"."email_address" = '' OR "customers"."email_address" IS NULL)
---
              <i class="fas fa-exclamation-triangle mr-2"></i>
              Found <strong><%= pluralize(@customers.count, 'customer') %></strong> missing email addresses

SELECT COUNT(*) FROM "customers"
SELECT COUNT(*) FROM "customers" WHERE NOT (("customers"."email_address" = '' OR "customers"."email_address" IS NULL))
---
          <div class="content">
            <% total_customers = Customer.count %>
            <% customers_with_email = Customer.where.not(email_address: [nil, '']).count %>